test/loadtest.yml
config:
  payload:
    path: "city_ids.csv"
    fields:
      - "city_id"
    order: "sequence"
    skipHeader: true
  target: "http://localhost:3000"
  phases:
    - duration: 1
      arrivalRate: 1000
scenarios:
  - flow:
    - loop:
      - get:
          url: "/v12"
          qs:
            cityId: "{{ city_id }}"
      count: 10